#Напишите программу, в которой пользователь будет 
# задавать две строки, а программа - определять 
# количество вхождений одной строки в другой.

str1 = input('введите слово')
str2 = input('введите предложение')

print(str1.count(str2))